/* File Upload multiple photos label */
"# Photos (file upload on page label for multiple photos)" = "%@ รูปภาพ";

/* File Upload images and videos label */
"# Photos and # Videos (file upload on page label for image and videos)" = "%@ และ %@";

/* File Upload multiple videos label */
"# Videos (file upload on page label for multiple videos)" = "%@ วิดีโอ";

/* accessibility help text for media controller time value >= 1 day */
"%1$d days %2$d hours %3$d minutes %4$d seconds" = "%1$d วัน %2$d ชั่วโมง %3$d นาที %4$d วินาที";

/* accessibility help text for media controller time value >= 60 minutes */
"%1$d hours %2$d minutes %3$d seconds" = "%1$d ชั่วโมง %2$d นาที %3$d วินาที";

/* accessibility help text for media controller time value >= 60 seconds */
"%1$d minutes %2$d seconds" = "%1$d นาที %2$d วินาที";

/* accessibility help text for media controller time value < 60 seconds */
"%1$d seconds" = "%1$d วินาที";

/* window title for a standalone image (uses multiplication symbol, not x) */
"%@ %@×%@ pixels" = "%@ %@×%@ พิกเซล";

/* visible name of the plug-in host process. The first argument is the plug-in name and the second argument is the application name. */
"%@ (%@ Internet plug-in)" = "%@ (ปลั๊กอินอินเทอร์เน็ตของ %@)";

/* Text track display name format that includes the language of the subtitle, in the form of 'Title (Language)' */
"%@ (%@)" = "%@ (%@)";

/* Text track display name format that includes the country and language of the subtitle, in the form of 'Title (Language-Country)' */
"%@ (%@-%@)" = "%@ (%@-%@)";

/* Text track contains closed captions */
"%@ CC" = "%@ CC";

/* visible name of the database process. The argument is the application name. */
"%@ Database Storage" = "เนื้อที่เก็บฐานข้อมูล %@";

/* Text track contains simplified (3rd grade level) subtitles */
"%@ Easy Reader" = "ตัวอ่านง่าย %@";

/* visible name of the network process. The argument is the application name. */
"%@ Networking" = "ระบบเครือข่ายของ %@";

/* Text track contains subtitles for the deaf and hard of hearing */
"%@ SDH" = "%@ SDH";

/* Visible name of the web process. The argument is the application name. */
"%@ Web Content" = "เนื้อหาเว็บ %@";

/* Name of application's single WebCrypto master key in Keychain */
"%@ WebCrypto Master Key" = "กุญแจหลัก WebCrypto ของ %@";

/* Label to describe the number of files selected in a file upload control that allows multiple files */
"%d files" = "%d ไฟล์";

/* Label for PDF page number indicator. */
"%d of %d" = "%d ของ %d";

/* Present the number of selected <option> items in a <select multiple> element (iOS only) */
"%zu Items" = "%zu รายการ";

/* Present the element <select multiple> when no <option> items are selected (iOS only) */
"0 Items" = "0 รายการ";

/* Present the element <select multiple> when a single <option> is selected (iOS only) */
"1 Item" = "1 รายการ";

/* File Upload single photo label */
"1 Photo (file upload on page label for one photo)" = "1 รูปภาพ";

/* File Upload single video label */
"1 Video (file upload on page label for one video)" = "1 วิดีโอ";

/* Menu item title for KEYGEN pop-up menu */
"1024 (Medium Grade)" = "1024 (เกรดปานกลาง)";

/* Menu item title for KEYGEN pop-up menu */
"2048 (High Grade)" = "2048 (เกรดสูง)";

/* Menu item title for KEYGEN pop-up menu */
"512 (Low Grade)" = "512 (เกรดต่ำ)";

/* window title for a standalone image (uses multiplication symbol, not x) */
"<filename> %d×%d pixels" = "<filename> %d×%d พิกเซล";

/* WKErrorJavaScriptExceptionOccurred description */
"A JavaScript exception occurred" = "เกิดการยกเว้นของ JavaScript";

/* Title for Add to Reading List action button */
"Add to Reading List" = "เพิ่มเข้ากับรายการอ่าน";

/* Undo action name */
"Align Left (Undo action name)" = "จัดชิดซ้าย";

/* Undo action name */
"Align Right (Undo action name)" = "จัดชิดขวา";

/* WKErrorUnknown description */
"An unknown error occurred" = "เกิดข้อผิดพลาดที่ไม่รู้จักขึ้น";

/* Menu item label for automatic track selection behavior */
"Auto (Recommended)" = "อัตโนมัติ (แนะนำ)";

/* Back context menu item */
"Back" = "กลับ";

/* Label text to be used if plugin is blocked by a page's Content Security Policy */
"Blocked Plug-In (Blocked by page's Content Security Policy)" = "ปลั๊กอินกั้นอยู่";

/* Label text to be used when an insecure plug-in version was blocked from loading */
"Blocked Plug-In (Insecure plug-in)" = "ปลั๊กอินกั้นอยู่";

/* Bold context menu item */
"Bold" = "ตัวหนา";

/* Undo action name */
"Bold (Undo action name)" = "ตัวหนา";

/* menu item title for phone number */
"Call Using iPhone:" = "โทรโดยใช้ iPhone:";

/* File Upload alert sheet button string to cancel */
"Cancel (file upload action sheet)" = "ยกเลิก";

/* Title for Cancel button label in button bar */
"Cancel button label in button bar" = "ยกเลิก";

/* Capitalize context menu item */
"Capitalize" = "ขึ้นต้นตัวพิมพ์ใหญ่";

/* Undo action name */
"Center (Undo action name)" = "กึ่งกลาง";

/* Undo action name */
"Change Attributes (Undo action name)" = "เปลี่ยนคุณสมบัติ";

/* Check spelling context menu item */
"Check Document Now" = "ตรวจสอบเอกสารเดี๋ยวนี้";

/* Check grammar with spelling context menu item */
"Check Grammar With Spelling" = "ตรวจสอบไวยากรณ์ด้วยการสะกด";

/* Check spelling while typing context menu item */
"Check Spelling While Typing" = "ตรวจสอบการสะกดขณะป้อน";

/* title for a single file chooser button used in HTML forms */
"Choose File" = "เลือกไฟล์";

/* title for a multiple file chooser button used in HTML forms. This title should be as short as possible. */
"Choose Files" = "เลือกไฟล์";

/* Title for file button used in HTML5 forms for multiple media files */
"Choose Media (Multiple)" = "เลือกสื่อ (หลายจำนวน)";

/* Title for file button used in HTML forms for media files */
"Choose Media (Single)" = "เลือกสื่อ (จำนวนเดียว)";

/* Clear button in date input popover */
"Clear Button Date Popover" = "ล้าง";

/* menu item in Recent Searches menu that empties menu's contents */
"Clear Recent Searches" = "ล้างการค้นหาล่าสุด";

/* Message to display in browser window when in webkit full screen mode. */
"Click to exit full screen mode" = "คลิกเพื่อออกจากโหมดเต็มจอ";

/* Subtitle of the label to show on a snapshotted plug-in */
"Click to restart" = "คลิกเพื่อเริ่มการทำงานใหม่";

/* WebKitErrorCannotShowMIMEType description */
"Content with specified MIME type can’t be shown" = "เนื้อหาที่มีการระบุชนิดของ MIME ไม่สามารถแสดงได้";

/* Media Controls context menu item */
"Controls" = "แถบควบคุม";

/* Copy context menu item */
"Copy" = "คัดลอก";

/* Title for Copy Link or Image action button */
"Copy ActionSheet Link" = "คัดลอก";

/* Copy Audio Address Location context menu item */
"Copy Audio Address" = "คัดลอกที่อยู่ของออดิโอ";

/* Copy Image context menu item */
"Copy Image" = "คัดลอกรูปภาพ";

/* Copy Link context menu item */
"Copy Link" = "คัดลอกลิงก์";

/* Copy Video Address Location context menu item */
"Copy Video Address" = "คัดลอกที่อยู่ของวิดีโอ";

/* Correct Spelling Automatically context menu item */
"Correct Spelling Automatically" = "แก้ไขการสะกดโดยอัตโนมัติ";

/* Undo action name */
"Create Link (Undo action name)" = "สร้างลิงก์";

/* Cut context menu item */
"Cut" = "ตัด";

/* Undo action name */
"Cut (Undo action name)" = "ตัด";

/* Default writing direction context menu item */
"Default" = "ค่าเริ่มต้น";

/* Undo action name (Used only by PLATFORM(IOS) code) */
"Delete (Undo action name)" = "ลบ";

/* text to display in <details> tag when it has no <summary> child */
"Details" = "รายละเอียด";

/* Undo action name (Used only by PLATFORM(IOS) code) */
"Dictation (Undo action name)" = "ป้อนตามคำบอก";

/* Download Audio To Disk context menu item */
"Download Audio" = "ดาวน์โหลดเสียง";

/* Download Image context menu item */
"Download Image" = "ดาวน์โหลดอิมเมจ";

/* Download Linked File context menu item */
"Download Linked File" = "ดาวน์โหลดไฟล์ที่ลิงก์";

/* Download Video To Disk context menu item */
"Download Video" = "ดาวน์โหลดวิดีโอ";

/* Undo action name */
"Drag (Undo action name)" = "ลาก";

/* Video Enter Fullscreen context menu item */
"Enter Full Screen" = "เข้าสู่เต็มหน้าจอ";

/* Video Exit Fullscreen context menu item */
"Exit Full Screen" = "ออกจากภาพเต็มหน้าจอ";

/* Default application name for Open With context menu */
"Finder" = "Finder";

/* Font context sub-menu item */
"Font" = "แบบอักษร";

/* Undo action name */
"Format Block (Undo action name)" = "จัดรูปแบบ";

/* Forward context menu item */
"Forward" = "ส่งต่อ";

/* WebKitErrorFrameLoadInterruptedByPolicyChange description */
"Frame load interrupted" = "การโหลดเฟรมมีการขัดจังหวะ";

/* accessibility role description for web area */
"HTML content" = "เนื้อหา HTML";

/* Hide Media Controls context menu item */
"Hide Controls" = "ซ่อนแถบควบคุม";

/* menu item title */
"Hide Spelling and Grammar" = "ซ่อนการสะกดและไวยากรณ์";

/* menu item title */
"Hide Substitutions" = "ซ่อนการเปลี่ยนแทนที่";

/* The default, default character encoding on Windows */
"ISO-8859-1" = "ISO-8859-1";

/* Ignore Grammar context menu item */
"Ignore Grammar" = "ไม่สนใจไวยากรณ์";

/* Ignore Spelling context menu item */
"Ignore Spelling" = "ไม่สนใจการสะกด";

/* Undo action name */
"Indent (Undo action name)" = "ย่อหน้า";

/* Undo action name */
"Insert List (Undo action name)" = "แทรกรายการ";

/* Inspect Element context menu item */
"Inspect Element" = "ตรวจสอบองค์ประกอบ";

/* Italic context menu item */
"Italic" = "ตัวเอียง";

/* Undo action name */
"Italics (Undo action name)" = "ตัวเอียง";

/* WebKitErrorJavaUnavailable description */
"Java is unavailable" = "Java ไม่สามารถใช้งานได้";

/* Title for action sheet for JavaScript link */
"JavaScript Action Sheet Title" = "JavaScript";

/* Undo action name */
"Justify (Undo action name)" = "จัดเต็มแนว";

/* Name of keychain key generated by the KEYGEN tag */
"Key from %@" = "กุญแจจาก %@";

/* Learn Spelling context menu item */
"Learn Spelling" = "เรียนรู้การสะกดคำ";

/* Left to Right context menu item */
"Left to Right" = "ซ้ายไปขวา";

/* Media controller status message when watching a live broadcast */
"Live Broadcast" = "ถ่ายทอดสด";

/* Media controller status message when the media is loading */
"Loading..." = "กำลังโหลด...";

/* Look Up in Dictionary context menu item */
"Look Up in Dictionary" = "ค้นหาในพจนานุกรม";

/* Look Up context menu item with selected word */
"Look Up “%@”" = "ค้นหา “%@”";

/* Look Up context menu item with selected word */
"Look Up “<selection>”" = "ดูใน “<selection>”";

/* Media Loop context menu item */
"Loop" = "เล่นวน";

/* Undo action name */
"Loosen Kerning (Undo action name)" = "กำหนดระยะห่างแบบหลวม ๆ";

/* Undo action name */
"Lower Baseline (Undo action name)" = "ลดเส้นบรรทัด";

/* Make Lower Case context menu item */
"Make Lower Case" = "ทำให้เป็นตัวพิมพ์เล็ก";

/* Make Upper Case context menu item */
"Make Upper Case" = "ทำให้เป็นตัวพิมพ์ใหญ่";

/* Label text to be used when a plugin is missing */
"Missing Plug-in" = "ไม่มีปลั๊กอิน";

/* Media Mute context menu item */
"Mute" = "ปิดเสียง";

/* No Guesses Found context menu item */
"No Guesses Found" = "ไม่พบการคาดเดา";

/* Empty select list */
"No Options Select Popover" = "ไม่มีตัวเลือก";

/* Label for only item in menu that appears when clicking on the search field image, when no searches have been performed */
"No recent searches" = "ไม่มีการค้นหาล่าสุด";

/* WebKitErrorCannotUseRestrictedPort description */
"Not allowed to use restricted network port" = "ไม่อนุญาตให้ใช้ช่องพอร์ตเครือข่ายที่เข้มงวด";

/* Menu item label for the track that represents disabling closed captions */
"Off" = "ปิด";

/* Title for Open Link action button */
"Open ActionSheet Link" = "เปิด";

/* Open Audio in New Window context menu item */
"Open Audio in New Window" = "เปิดออดิโอในหน้าต่างใหม่";

/* Open Frame in New Window context menu item */
"Open Frame in New Window" = "เปิดในหน้าต่างใหม่";

/* Open Image in New Window context menu item */
"Open Image in New Window" = "เปิดในหน้าต่างใหม่";

/* Open Link context menu item */
"Open Link" = "เปิดลิงก์";

/* Open in New Window context menu item */
"Open Link in New Window" = "เปิดในหน้าต่างใหม่";

/* Open Video in New Window context menu item */
"Open Video in New Window" = "เปิดวิดีโอในหน้าต่างใหม่";

/* context menu item for PDF */
"Open with %@" = "เปิดด้วย “%@”";

/* Undo action name */
"Outdent (Undo action name)" = "เยื้องออก";

/* Outline context menu item */
"Outline" = "เค้าโครง";

/* Undo action name */
"Outline (Undo action name)" = "เค้าโครง";

/* Paragraph direction context sub-menu item */
"Paragraph Direction" = "ทิศทางย่อหน้า";

/* Paste context menu item */
"Paste" = "วาง";

/* Undo action name */
"Paste (Undo action name)" = "วาง";

/* Undo action name */
"Paste Font (Undo action name)" = "วางแบบอักษร";

/* Undo action name */
"Paste Ruler (Undo action name)" = "วางไม้บรรทัด";

/* Media Pause context menu item */
"Pause" = "พัก";

/* File Upload alert sheet button string for choosing an existing media item from the Photo Library */
"Photo Library (file upload action sheet)" = "คลังรูปภาพ";

/* Media Play context menu item */
"Play" = "เล่น";

/* accessibility help text for enter fullscreen button */
"Play movie in fullscreen mode" = "ฉายภาพยนตร์ในโหมดเต็มจอ";

/* Label text to be used if plugin host process has crashed */
"Plug-in Failure" = "ปลั๊กอินขัดข้อง";

/* WebKitErrorPlugInCancelledConnection description */
"Plug-in cancelled" = "ปลั๊กอินถูกยกเลิก";

/* WebKitErrorPlugInWillHandleLoad description */
"Plug-in handled load" = "ปลั๊กอินการจัดการโหลด";

/* Description of the primary type supported by the PDF pseudo plug-in. Visible in the Installed Plug-ins page in Safari. */
"Portable Document Format" = "Portable Document Format";

/* Description of the PostScript type supported by the PDF pseudo plug-in. Visible in the Installed Plug-ins page in Safari. */
"PostScript" = "PostScript";

/* Undo action name */
"Raise Baseline (Undo action name)" = "ยกเส้นบรรทัด";

/* label for first item in the menu that appears when clicking on the search field image, used as embedded menu title */
"Recent Searches" = "การค้นหาล่าสุด";

/* Reload context menu item */
"Reload" = "โหลดใหม่";

/* default label for Reset buttons in forms on web pages */
"Reset" = "รีเซ็ต";

/* Right to Left context menu item */
"Right to Left" = "ขวาไปซ้าย";

/* Title for Save Image action button */
"Save Image" = "บันทึกรูปภาพ";

/* Search in Spotlight context menu item */
"Search in Spotlight" = "ค้นหาใน Spotlight";

/* Search with search provider context menu item with provider name inserted */
"Search with %@" = "ค้นหาด้วย %@";

/* Search with Google context menu item */
"Search with Google" = "ค้นหาด้วย Google";

/* Selection direction context sub-menu item */
"Selection Direction" = "ทิศทางการเลือก";

/* Undo action name */
"Set Background Color (Undo action name)" = "ตั้งค่าสีพื้นหลัง";

/* Undo action name */
"Set Color (Undo action name)" = "ตั้งค่าสี";

/* Undo action name */
"Set Font (Undo action name)" = "ตั้งแบบอักษร";

/* Undo action name */
"Set Traditional Character Shape (Undo action name)" = "ตั้งค่าลักษณะอักขระแบบดั้งเดิม";

/* Undo action name */
"Set Writing Direction (Undo action name)" = "ตั้งทิศทางการเขียน";

/* Show colors context menu item */
"Show Colors" = "แสดงสี";

/* Show Media Controls context menu item */
"Show Controls" = "แสดงแถบควบคุม";

/* Show fonts context menu item */
"Show Fonts" = "แสดงแบบอักษร";

/* menu item title */
"Show Spelling and Grammar" = "แสดงการสะกดและไวยากรณ์";

/* menu item title */
"Show Substitutions" = "แสดงการเปลี่ยนแทนที่";

/* Title of the context menu item to show when PDFPlugin was used instead of a blocked plugin */
"Show in blocked plug-in" = "แสดงในปลั๊กอินที่กั้นอยู่";

/* Smart Copy/Paste context menu item */
"Smart Copy/Paste" = "คัดลอกหรือวางอัจฉริยะ";

/* Smart Dashes context menu item */
"Smart Dashes" = "ขีดกลางอัจฉริยะ";

/* Smart Links context menu item */
"Smart Links" = "ลิงก์อัจฉริยะ";

/* Smart Quotes context menu item */
"Smart Quotes" = "อัญประกาศอัจฉริยะ";

/* Title of the label to show on a snapshotted plug-in */
"Snapshotted Plug-In" = "ปลั๊กอินภาพหน้าจอ";

/* Speech context sub-menu item */
"Speech" = "เสียงพูด";

/* Spelling and Grammar context sub-menu item */
"Spelling and Grammar" = "การสะกดและไวยากรณ์";

/* title for Start Debugging JavaScript menu item */
"Start Debugging JavaScript" = "เริ่มดีบั๊ก JavaScript";

/* title for Start Profiling JavaScript menu item */
"Start Profiling JavaScript" = "เริ่มการทำโปรไฟล์ JavaScript";

/* Start speaking context menu item */
"Start Speaking" = "เริ่มพูด";

/* Stop context menu item */
"Stop" = "หยุด";

/* title for Stop Debugging JavaScript menu item */
"Stop Debugging JavaScript" = "เลิกการดีบั๊ก JavaScript";

/* title for Stop Profiling JavaScript menu item */
"Stop Profiling JavaScript" = "เลิกการทำโปรไฟล์ JavaScript";

/* Stop speaking context menu item */
"Stop Speaking" = "หยุดพูด";

/* Styles context menu item */
"Styles..." = "รูปแบบ...";

/* default label for Submit buttons in forms on web pages */
"Submit" = "ส่ง";

/* alt text for <input> elements with no alt, title, or value */
"Submit (input element)" = "ส่ง";

/* Undo action name */
"Subscript (Undo action name)" = "ตัวห้อย";

/* Substitutions context sub-menu item */
"Substitutions" = "การเปลี่ยนแทนที่";

/* Menu section heading for subtitles */
"Subtitles" = "คำบรรยาย";

/* Undo action name */
"Superscript (Undo action name)" = "ตัวยก";

/* File Upload alert sheet camera button string for taking only photos */
"Take Photo (file upload action sheet)" = "ถ่ายภาพ";

/* File Upload alert sheet camera button string for taking photos or videos */
"Take Photo or Video (file upload action sheet)" = "ถ่ายภาพหรือถ่ายวิดีโอ";

/* File Upload alert sheet camera button string for taking only videos */
"Take Video (file upload action sheet)" = "ถ่ายวิดีโอ";

/* Text Replacement context menu item */
"Text Replacement" = "การแทนที่ข้อความ";

/* WebKitErrorCannotShowURL description */
"The URL can’t be shown" = "ไม่สามารถแสดง URL ได้";

/* WKErrorWebViewInvalidated description */
"The WKWebView was invalidated" = "WKWebView ไม่ถูกต้อง";

/* WKErrorWebContentProcessTerminated description */
"The Web Content process was terminated" = "กระบวนการเนื้อหาเว็บถูกทำให้เลิกทำงาน";

/* WebKitErrorGeolocationLocationUnknown description */
"The current location cannot be found." = "ไม่พบตำแหน่งปัจจุบัน";

/* WebKitErrorCannotFindPlugin description */
"The plug-in can’t be found" = "ปลั๊กอินไม่พบ";

/* WebKitErrorCannotLoadPlugin description */
"The plug-in can’t be loaded" = "ปลั๊กอินโหลดไม่ได้";

/* prompt string in authentication panel */
"The user name or password you entered for area “%@” on %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "ชื่อผู้ใช้งานหรือรหัสผ่านที่ป้อนเข้าไปสำหรับบริเวณ “%@” ใน %@ ไม่ถูกต้อง ต้องแน่ใจว่าป้อนชื่อและรหัสผ่านเข้าไปอย่างถูกต้อง แล้วจึงพยายามอีกครั้ง";

/* prompt string in authentication panel */
"The user name or password you entered for the %@ proxy server %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "ชื่อผู้ใช้งานหรือรหัสผ่านที่ป้อนเข้าไปสำหรับเซิร์ฟเวอร์พร็อกซี่ %@ “%@” ไม่ถูกต้อง ต้องแน่ใจว่าป้อนชื่อและรหัสผ่านเข้าไปอย่างถูกต้อง แล้วลองอีกครั้ง";

/* prompt string in authentication panel */
"The user name or password you entered for this area on %@ was incorrect. Make sure you’re entering them correctly, and then try again." = "ชื่อผู้ใช้งานหรือรหัสผ่านที่ป้อนเข้าไปสำหรับบริเวณ %@ ไม่ถูกต้อง  ต้องแน่ใจว่าป้อนชื่อและรหัสผ่านเข้าไปอย่างถูกต้อง แล้วจึงพยายามอีกครั้ง";

/* text that appears at the start of nearly-obsolete web pages in the form of a 'searchable index' */
"This is a searchable index. Enter search keywords: " = "นี่คือดรรชนีที่ค้นหาได้ ป้อนคำสำคัญที่ต้องการค้นหา: ";

/* Undo action name */
"Tighten Kerning (Undo action name)" = "ระยะห่างแน่น";

/* prompt string in authentication panel */
"To view this page, you must log in to area “%@” on %@." = "หากต้องการดูหน้าเว็บนี้ คุณต้องลงชื่อเข้าใช้ในบริเวณ “%@” ใน %@";

/* prompt string in authentication panel */
"To view this page, you must log in to the %@ proxy server %@." = "ในการดูหน้าเว็บนี้ คุณต้องเข้าสู่ระบบที่เซิร์ฟเวอร์พร็อกซี่ %@ “%@”";

/* prompt string in authentication panel */
"To view this page, you must log in to this area on %@:" = "หากต้องการดูหน้าเว็บนี้ คุณต้องลงชื่อเข้าใช้ในบริเวณนี้ที่ %@:";

/* Transformations context sub-menu item */
"Transformations" = "การแปลงรูปแบบ";

/* Undo action name */
"Turn Off Kerning (Undo action name)" = "ปิดการกำหนดระยะห่าง";

/* Undo action name */
"Turn Off Ligatures (Undo action name)" = "ปิดกลุ่มอักษรควบ";

/* We don't care if we find this string, but searching for it will load the plist and save the results. */
"Typing (Undo action name)" = "ป้อน";

/* Underline context menu item */
"Underline" = "ขีดเส้นใต้";

/* Undo action name */
"Underline (Undo action name)" = "ขีดเส้นใต้";

/* Unknown filesize FTP directory listing item */
"Unknown (filesize)" = "ไม่รู้จัก";

/* Menu item label for a text track that has no other name */
"Unknown (text track)" = "ไม่รู้จัก";

/* Undo action name */
"Unlink (Undo action name)" = "เลิกลิงก์";

/* Undo action name */
"Unscript (Undo action name)" = "เลิกทำสคริปต์";

/* Undo action name */
"Use All Ligatures (Undo action name)" = "ใช้กลุ่มอักษรควบทั้งหมด";

/* Undo action name */
"Use Standard Kerning (Undo action name)" = "ใช้การกำหนดระยะห่างมาตรฐาน";

/* Undo action name */
"Use Standard Ligatures (Undo action name)" = "ใช้กลุ่มอักษรควบมาตรฐาน";

/* Description of WebCrypto master keys in Keychain */
"Used to encrypt WebCrypto keys in persistent storage, such as IndexedDB" = "ใช้เพื่อเข้ารหัสกุญแจ WebCrypto กับเนื้อที่เก็บข้อมูลถาวร เช่น IndexedDB";

/* Web Inspector window title */
"Web Inspector — %@" = "ตัวตรวจสอบเว็บ — %@";

/* Pseudo plug-in name, visible in the Installed Plug-ins page in Safari. */
"WebKit built-in PDF" = "WebKit กับ PDF ในตัว";

/* WebKitErrorInternal description */
"WebKit encountered an internal error" = "WebKit เกิดข้อผิดพลาดภายใน";

/* message in authentication panel */
"Your login information will be sent securely." = "ข้อมูลการเข้าสู่ระบบของคุณจะถูกส่งอย่างปลอดภัย";

/* message in authentication panel */
"Your password will be sent unencrypted." = "รหัสผ่านของคุณจะถูกส่งแบบไม่เข้ารหัส";

/* HTTP result code string */
"accepted" = "ยอมรับ";

/* Verb stating the action that will occur when a text field is selected, as used by accessibility */
"activate" = "กระตุ้นให้ทำงาน";

/* An ARIA accessibility group that acts as an alert. */
"alert" = "การเตือน";

/* An ARIA accessibility group that acts as an alert dialog. */
"alert dialog" = "หน้าต่างโต้ตอบการเตือน";

/* An ARIA accessibility group that acts as an application. */
"application" = "แอปพลิเคชั่น";

/* An ARIA accessibility group that acts as a status update. */
"application status" = "สถานะแอปพลิเคชั่น";

/* An ARIA accessibility group that acts as an article. */
"article" = "บทความ";

/* accessibility help text for audio element controller */
"audio element playback controls and status display" = "แถบควบคุมการเล่นองค์ประกอบเสียงและแถบแสดงสถานะ";

/* accessibility label for audio element controller */
"audio playback" = "การเล่นเสียง";

/* accessibility label for seek back 30 seconds button */
"back 30 seconds" = "ย้อนกลับ 30 วินาที";

/* HTTP result code string */
"bad gateway" = "เกตเวย์ไม่สมบูรณ์";

/* HTTP result code string */
"bad request" = "คำขอไม่สมบูรณ์";

/* An ARIA accessibility group that acts as a banner. */
"banner" = "แถบค้นหา";

/* accessibility help text for play button */
"begin playback" = "เริ่มการเล่นกลับ";

/* accessibility description for a search field cancel button */
"cancel" = "ยกเลิก";

/* Verb stating the action that will occur when an unchecked checkbox is clicked, as used by accessibility */
"check" = "ตรวจสอบ";

/* HTTP result code string */
"client error" = "ข้อผิดพลาดลูกข่าย";

/* An ARIA accessibility group that acts as a region of complementary information. */
"complementary" = "ส่วนประกอบสมบูรณ์";

/* HTTP result code string */
"conflict" = "ความขัดแย้ง";

/* An ARIA accessibility group that contains content. */
"content information" = "ข้อมูลเนื้อหา";

/* HTTP result code string */
"continue" = "ดำเนินการต่อ";

/* HTTP result code string */
"created" = "สร้างแล้ว";

/* accessibility help text for movie status display */
"current movie status" = "สถานะภาพยนตร์ปัจจุบัน";

/* accessibility help text for elapsed time display */
"current movie time in seconds" = "เวลาภาพยนต์ปัจจุบันเป็นวินาที";

/* role description of ARIA definition role */
"definition" = "คำจำกัดความ";

/* description detail */
"description" = "รายละเอียด";

/* accessibility role description of a description list */
"description list" = "รายการคำอธิบาย";

/* An ARIA accessibility group that acts as an dialog. */
"dialog" = "หน้าต่างโต้ตอบ";

/* An ARIA accessibility group that acts as a document. */
"document" = "เอกสาร";

/* accessibility label for elapsed time display */
"elapsed time" = "เวลาที่ใช้ไป";

/* accessibility label for enter fullscreen button */
"enter fullscreen" = "เข้าสู่หน้าจอเต็ม";

/* accessibility label for exit fullscreen button */
"exit fullscreen" = "ออกจากหน้าจอเต็ม";

/* HTTP result code string */
"expectation failed" = "ความคาดหวังล้มเหลว";

/* accessibility label for fast forward button */
"fast forward" = "กรอส่งต่อ";

/* accessibility label for fast reverse button */
"fast reverse" = "ย้อนกลับอย่างรวดเร็ว";

/* accessibility role description for a file upload button */
"file upload button" = "ปุ่มอัปโหลดไฟล์";

/* accessibility role description for a footer */
"footer" = "ท้ายกระดาษ";

/* HTTP result code string */
"forbidden" = "ไม่อนุญาต";

/* HTTP result code string */
"found" = "พบ";

/* HTTP result code string */
"gateway timed out" = "เกทเวย์หมดเวลา";

/* accessibility role description for headings */
"heading" = "หัวเรื่อง";

/* accessibility label for hide closed captions button */
"hide closed captions" = "ซ่อนคำบรรยายภาพ";

/* accessibility role description for image map */
"image map" = "แผนที่ภาพ";

/* accessibility help text for an indefinite media controller time value */
"indefinite time" = "เวลาที่ไม่จำกัด";

/* HTTP result code string */
"informational" = "ให้ข้อมูล";

/* HTTP result code string */
"internal server error" = "ข้อผิดพลาดเซิร์ฟเวอร์ภายใน";

/* Verb stating the action that will occur when a link is clicked, as used by accessibility */
"jump" = "ข้าม";

/* HTTP result code string */
"length required" = "ต้องกำหนดความยาว";

/* accessibility role description for link */
"link" = "ลิงก์";

/* accessibility role description for list marker */
"list marker" = "เครื่องหมายรายการ";

/* An ARIA accessibility group that acts as a console log. */
"log" = "บันทึก";

/* An ARIA accessibility group that is the main portion of the website. */
"main" = "หลัก";

/* An ARIA accessibility group that acts as a marquee. */
"marquee" = "ส่วนเกิน";

/* An ARIA accessibility group that contains mathematical symbols. */
"math" = "คณิตศาสตร์";

/* HTTP result code string */
"method not allowed" = "วิธีการที่ไม่ได้รับอนุญาต";

/* HTTP result code string */
"moved permanently" = "ย้ายถาวร";

/* accessibility label for timeline slider */
"movie time" = "เวลาภาพยนตร์";

/* accessibility help text for timeline slider */
"movie time scrubber" = "ตัวรักษาเวลาภาพยนต์";

/* accessibility help text for timeline slider thumb */
"movie time scrubber thumb" = "ปุ่มรักษาเวลาภาพยนต์";

/* HTTP result code string */
"multiple choices" = "ตัวเลือกหลายจำนวน";

/* accessibility label for mute button */
"mute" = "ปิดเสียง";

/* accessibility help text for mute button */
"mute audio tracks" = "ปิดแทร็คเสียง";

/* An ARIA accessibility group that contains the main navigation elements of a website. */
"navigation" = "ระบบนำทาง";

/* HTTP result code string */
"needs proxy" = "ต้องใช้พร็อกซี่";

/* HTTP result code string */
"no content" = "ไม่มีเนื้อหา";

/* HTTP result code string */
"no error" = "ไม่มีข้อผิดพลาด";

/* text to display in file button used in HTML forms when no file is selected */
"no file selected" = "ไม่มีไฟล์ที่เลือกไว้";

/* text to display in file button used in HTML forms when no files are selected and the button allows multiple files to be selected */
"no files selected" = "ไม่ได้เลือกไฟล์";

/* HTTP result code string */
"no longer exists" = "ไม่มีอีกต่อไป";

/* Text to display in file button used in HTML forms for media files when no media files are selected and the button allows multiple files to be selected */
"no media selected (multiple)" = "ไม่ได้เลือกสื่อ (หลายจำนวน)";

/* Text to display in file button used in HTML forms for media files when no media file is selected */
"no media selected (single)" = "ไม่ได้เลือกสื่อ (จำนวนเดียว)";

/* HTTP result code string */
"non-authoritative information" = "ข้อมูลซึ่งไม่สามารถรับรองได้";

/* HTTP result code string */
"not found" = "ไม่พบ";

/* HTTP result code string */
"not modified" = "ไม่ได้ปรับแต่ง";

/* An ARIA accessibility group that acts as a note in a document. */
"note" = "หมายเหตุ";

/* accessibility help text for remaining time display */
"number of seconds of movie remaining" = "จำนวนวินาทีของภาพยนต์ที่เหลืออยู่";

/* HTTP result code string */
"partial content" = "เนื้อหาบางส่วน";

/* Validation message for input form controls requiring a constrained value according to pattern */
"pattern mismatch" = "แพทเทิร์นไม่ตรงกัน";

/* accessibility label for pause button */
"pause" = "พัก";

/* accessibility help text for pause button */
"pause playback" = "พักการเล่นกลับ";

/* HTTP result code string */
"payment required" = "ต้องชำระเงิน";

/* accessibility label for play button */
"play" = "เล่น";

/* HTTP result code string */
"precondition failed" = "กำหนดเงื่อนไขเบื้องต้นล้มเหลว";

/* Verb stating the action that will occur when a button is pressed, as used by accessibility */
"press" = "กด";

/* HTTP result code string */
"proxy authentication required" = "ต้องใช้การรับรองความถูกต้องผ่านพร็อกซี่";

/* Validation message for input form controls with value higher than allowed maximum */
"range overflow" = "ล้นช่วง";

/* Validation message for input form controls with value lower than allowed minimum */
"range underflow" = "ช่วงที่น้อยเกินเก็บ";

/* HTTP result code string */
"redirected" = "เปลี่ยนเส้นทาง";

/* An ARIA accessibility group that acts as a distinct region in a document. */
"region" = "ภูมิภาค";

/* accessibility label for time remaining display */
"remaining time" = "เวลาที่เหลือ";

/* HTTP result code string */
"request timed out" = "คำขอเกินกำหนดเวลา";

/* HTTP result code string */
"request too large" = "คำขอใหญ่เกินไป";

/* HTTP result code string */
"requested URL too long" = "URL ที่ขอยาวเกินไป";

/* HTTP result code string */
"requested range not satisfiable" = "ช่วงที่ขอไม่เป็นไปตามที่ต้องการ";

/* HTTP result code string */
"reset content" = "รีเซ็ตเนื้อหา";

/* accessibility help text for return streaming movie to real time button */
"return streaming movie to real time" = "เปลี่ยนภาพยนต์เคลื่อนที่เร็วกลับไปเป็นเวลาจริง";

/* accessibility label for return to real time button */
"return to realtime" = "เปลี่ยนกลับไปเป็นเวลาจริง";

/* An ARIA accessibility group that contains a search feature of a website. */
"search" = "ค้นหา";

/* HTTP result code string */
"see other" = "ดูอื่นๆ";

/* accessibility help text for jump back 30 seconds button */
"seek movie back 30 seconds" = "ขอภาพยนต์กลับ 30 วินาที";

/* accessibility help text for fast rewind button */
"seek quickly back" = "ค้นกลับอย่างรวดเร็ว";

/* accessibility help text for fast forward button */
"seek quickly forward" = "เลื่อนส่งต่ออย่างรวดเร็ว";

/* Verb stating the action that will occur when a radio button is clicked, as used by accessibility */
"select" = "เลือก";

/* accessibility role description for a horizontal rule [<hr>] */
"separator" = "ตัวแยก";

/* HTTP result code string */
"server error" = "ข้อผิดพลาดเซิร์ฟเวอร์";

/* HTTP result code string */
"service unavailable" = "ไม่พร้อมให้บริการ";

/* accessibility label for show closed captions button */
"show closed captions" = "แสดงคำบรรยายภาพ";

/* accessibility help text for show closed captions button */
"start displaying closed captions" = "เริ่มแสดงคำบรรยายภาพ";

/* accessibility label for movie status */
"status" = "สถานะ";

/* Validation message for input form controls with value not respecting the step attribute */
"step mismatch" = "ขั้นตอนไม่ตรงกัน";

/* accessibility help text for hide closed captions button */
"stop displaying closed captions" = "หยุดแสดงคำบรรยายภาพ";

/* HTTP result code string */
"success" = "สำเร็จ";

/* HTTP result code string */
"switching protocols" = "กำลังสลับโปรโตคอล";

/* An ARIA accessibility group that contains the content of a tab. */
"tab panel" = "แผงแถบ";

/* HTTP result code string */
"temporarily redirected" = "เปลี่ยนเส้นทางชั่วคราว";

/* term word of a description list */
"term" = "คำศัพท์";

/* accessibility label for timeline thumb */
"timeline slider thumb" = "ปุ่มเลื่อนเส้นเวลา";

/* An ARIA accessibility group that acts as an updating timer. */
"timer" = "นาฬิกาจับเวลา";

/* Validation message for form control elements with a value longer than maximum allowed length */
"too long" = "ยาวเกินไป";

/* An ARIA accessibility group that acts as a tooltip. */
"tooltip" = "เคล็ดเครื่องมือ";

/* Validation message for input form controls with a value not matching type */
"type mismatch" = "ประเภทไม่ตรงกัน";

/* HTTP result code string */
"unacceptable" = "ยอมรับไม่ได้";

/* HTTP result code string */
"unauthorized" = "ไม่ได้รับการรับรอง";

/* Verb stating the action that will occur when a checked checkbox is clicked, as used by accessibility */
"uncheck" = "เลิกเลือก";

/* HTTP result code string */
"unimplemented" = "ไม่ได้ปรับใช้";

/* Unknown filename */
"unknown" = "ไม่รู้จัก";

/* accessibility label for turn mute off button */
"unmute" = "เปิดเสียง";

/* accessibility help text for un mute button */
"unmute audio tracks" = "เลิกปิดเสียงแทร็ก";

/* HTTP result code string */
"unsupported media type" = "ประเภทสื่อไม่รองรับ";

/* HTTP result code string */
"unsupported version" = "เวอร์ชั่นไม่รองรับ";

/* Validation message for required form control elements that have no value */
"value missing" = "ค่าที่หายไป";

/* accessibility help text for video element controller */
"video element playback controls and status display" = "แถบควบคุมการเล่นองค์ประกอบวิดีโอและแถบแสดงสถานะ";

/* accessibility label for video element controller */
"video playback" = "การเล่นวิดีโอ";

/* "Open Link in Default Browser" action menu item */
"Open (action menu item)" = "เปิด";

/* "Preview Link" action menu item */
"Preview (action menu item)" = "การแสดงตัวอย่าง";

/* "Add to Reading List" action menu item */
"Add to Reading List (action menu item)" = "เพิ่มเข้ากับรายการอ่าน";

/* "Copy" action menu item in image menu */
"Copy (image action menu item)" = "คัดลอก";

/* "Add to Photos" action menu item */
"Add to Photos (action menu item)" = "เพิ่มไปที่แอปรูปภาพ";

/* "Save to Downloads" action menu item in image menu */
"Save to Downloads (image action menu item)" = "บันทึกไปยังรายการดาวน์โหลด";

/* "Share" action menu item in image menu */
"Share (image action menu item)" = "แชร์";

/* "Copy" action menu item in text menu */
"Copy (text action menu item)" = "คัดลอก";

/* "Look Up" action menu item */
"Look Up (action menu item)" = "ค้นดู";

/* "Paste" action menu item */
"Paste (action menu item)" = "วาง";

/* "Suggestions" action menu item */
"Suggestions (action menu item)" = "คำแนะนำ";

/* "Copy" action menu item in video menu */
"Copy (video action menu item)" = "คัดลอก";

/* "Share" action menu item in video menu */
"Share (video action menu item)" = "แชร์";

/* "Save to Downloads" action menu item in video menu */
"Save to Downloads (video action menu item)" = "บันทึกไปยังรายการดาวน์โหลด";
